// app.js
const width = wx.getSystemInfoSync().windowWidth//系统宽度
const topx = width / 750 //rpx转px系数
App({
    onLaunch() {
        wx.cloud.init({
          env:'cloud1-5gynw2ctad593524'//开发环境ID
        })
      },
    globalData:{//全局变量
      isInit:false,
      user:'',//用户基本信息(users表):昵称和头像链接
      openID:'',
      Friends:[],
      FriendsUserinfo:[],
      MessageDetail:[],
      unread:[],
      isboss:false,//是否为boss
      worker:{//员工的基本信息(worker表)：意向地址，意向工资，datas(投递、交流、收藏的数量),意向岗位
        yx_address:['四川省','广元市','旺苍县'],//默认
        yx_salary:[0,5],
        datas:[0,0,0],
        yx_post:[0,0],
        yx_post1:0,
        yx_post2:0
      },
      worker_post:[0,0],
      job_post:[0,0],
      post_classify:['技工/普工',
      '农/林/牧/渔',
      '服饰行业',
      '机械/汽车',
      '物流/仓储/运输',
      '销售/商务/客服',
      '房地产/建筑/工程',
      '物业管理',
      '百货零售',
      '家政保洁',
      '互联网技术',
      '互联网运营',
      '互联网产品',
      '市场/传媒',
      '设计',
      '人力行政',
      '财务金融',
      '教育培训',
      '电子电气',
      '法律/翻译/咨询',
      '采购/外贸',
      '质量/生产管理',
      '酒店/餐饮/旅游',
      '生物/医疗',
      '美容健身',
      '化学/化工'],
      post:[['普工/操作工','技工','焊工','电工','铲/叉车司机','空调工','水工','电镀工','喷塑工','木工','漆工','电梯工','锅炉工','学徒工','吊车司机','挖掘机司机','电力线陆工','旋压工','仪表工','氩弧焊工'],
            ['畜牧师','饲料研发','农艺师','园艺师','兽医','水产养殖技术员','林业技术员','饲养工','帮工','其他','短工'],
            ['服装/纺织设计','纸样师','裁床','裁剪工','缝纫工','手缝工','烫工','样衣工','纺织工','针织工','配色工','印染工','漂染工','挡车工','细纱工','浆纱工'],
            ['机械工程师','工艺工程师','汽车工程师','汽车美容','设备维修','机械结构工程师','汽车服务顾问','机械设计师','机械制图'],
            ['仓储','物流专员','运输','快递/配送','仓库管理员','仓库文书','安检员','搬运工','物流销售','分拣员','装卸工','乘务员','商务司机','飞机机长/副机长','空乘人员','地勤人员','列车/地铁车长','列车/地铁司机','船长/副船长','船员','其他','客运司机','货运司机','出租车司机','班车司机','特种车司机','驾校教练','代驾','站务人员'],
            ['销售','海外销售','电话销售','渠道/分销','房地产销售','医美咨询','健康顾问','汽车销售','理财销售','保险销售','招生/课程顾问','广告/媒体销售','商务','客服','销售技术支持','销售运营'],
            ['建筑工程师结构','土木土建工程师','建筑机电工程师','给排水','暖通工程','工程造价师','预结算经理','建筑工程管理','项目经理','工程监理','建筑安装施工员','消防安全','其他','公路','桥梁/港口/隧道工程','岩土工程','测绘/测量','建筑工程验收','幕墙工程师','高级建筑工程师','总工预结算员','楼宇自动化','智能大厦/综合布线/安防/弱电','开发报建','合同管理','安全员','资料员','市政工程师','建筑项目助理','砌筑工','瓦工','混凝土工','浇注工','钢筋工','木工','油漆工','电梯工','抹灰工','施工开料工','管道/暖通','工长','精装修工程师','房修工程师','材料员'],
            ['物业顾问','物业管理经理','物业管理专员/助理','招商/租赁/租售','物业设施管理人员','物业维修员','其他','物业机电工程师','停车管理员','保安经理','保安人员','保洁','绿化工','物业管理主管','物业机电维修工','前介工程师','长租公寓管家','养老专员','写字楼运营'],
            ['门店经理/店长','店员/营业员','收银主','管陈列员','促销员/导购员','兼职店员','其他','防损员/内保','西点师/面包糕点加工','生鲜食品加工/处理','熟食加工','品类管理','安防主管','品牌/连锁招商管理','奢侈品业务','珠宝销售顾问','促销主管/督导/巡店','收银员','收货员','理货员','店长助理','导购管理','陈列管理','商品管理'],
            ['保镖','寻呼员/话务员','清洁工','家政服务/保姆','其他','月嫂','育婴师/保育员','护工','钟点工','洗衣工','送水工','空调维修','家电维修'],
            ['后端开发','JAVA','测试工程师','项目管理','web前端','运维工程师','数据挖掘/机器学习','C++','算法工程师','语言/视频/图像处理','自然语言处理','数据开发','搜索/广告/推荐算法','Android','数据分析师','C#','PHP','IOS','IT技术支持','Golang','Python','IT硬件','售前技术支持','软件测试','U3D/COCOS2DX','网络工程师','网络安全','嵌入式','施工工程师','项目助理','售后技术支持','项目专员','Node.js','Ruby/Perl','自动化'],
            ['内容运营','产品运营','新媒体','用户运营','客服','电商运营','新媒体运营','客服专员','运营助理/专员','SEO/SEM','游戏运营','直播运营','网络客服','文案策划','内容编辑','跨境电商运营','售后客服','电话客服','售前客服'],
            ['产品经理','游戏策划','产品助理','数据产品经理','产品专员','用户研究'],
            ['创意/策划/公关','市场营销','新闻/编辑','摄影摄像','广告设计','导演/编剧','影视管理/发行','市场推广','主持人/主播/DJ','网络推广','后期制作','视频编辑','市场策划','剪辑师','会务会展','海外市场','剪辑师','活动策划','演员/配音/模特','自媒体','游戏推广','化妆/造型/服装'],
            ['UI设计','视觉设计师','平面设计','用户体验/交互','游戏/动画设计','美工','其它设计','3D设计师','CAD设计/制图','插画师','原画师','设计师助理','服装/纺织设计','工业设计'],
            ['行政专员/助理','人力资源/专员','总助/CEO助理/董事长助理','招聘','经理助理','后勤','前台'],
            ['银行','财会/审计','投融资','互联网金融','证券/基金','风控','会计','保险','行业研究','出纳','投资顾问'],
            ['教师','教务管理','课程顾问','职业培训','教研/课程设计','体育教师','IT培训','班主任/辅导员','英语教师','助教','家教/托管','小学教师','初中教师','高中教师','机器人/乐高培训','幼教','舞蹈老师','音乐老师','美术老师','球类教练','播音/表演教师'],
            ['硬件工程师','通信技术工程师','电气/自动化','电子工程师'],
            ['咨询/调研','企业管理咨询','法务','英语翻译','咨询项目管理','律师','法务专员/助理','日语翻译','法语翻译','其他语种翻译'],
            ['采购','采购专员/助理','外贸业务员','外贸文员','贸易跟单','单证员'],
            ['质检','生产运营','质量管理','生产计划管理'],
            ['服务员','厨师','餐饮店长','旅游服务','酒店前台','后厨帮工','导游/讲解员','礼仪/迎宾','调酒师/侍酒师/吧台员','茶艺师','其他','传菜主管','厨师助理/学徒','配菜/打荷','洗碗工','送餐员','咖啡师','杂工','餐饮收银员','餐饮大堂经理','西餐厨师','日式厨师','面点师','西点师','餐饮预订员','传菜员','调饮师','食品安全管理师'],
            ['医疗销售','健康整形','医疗器械','生物制药','医药研发','医药编辑','医生助理','内科医生','医院管理人员','药库主任/药剂师','护士/护理人员','麻醉医生','心理医生','医学检验','其他','针灸/推拿','营养师','兽医','外科医生','专科医生','牙科医生','美容整形师','理疗师','中医科医生','公共卫生/疾病控制','护理主任/护士长','儿科医生','验光师','超声影像/放射科医师','综合门诊/全科医生','医美咨询','健康管理师','核酸检测员','防疫员','消毒员','心理咨询师','导医','妇产科医生','眼科医生','医学顾问'],
            ['美容顾问','美容助理','瘦身顾问','发型师','发型助理/学徒','美甲师','按摩','宠物护理/美容','其他','彩妆培训师','专柜彩妆顾问','美容培训师/导师','美体师','美容店长','美容师','化妆师','造型师','美发店长','SPA技师','足疗'],
            ['化学工程师','实验室技术员','化学分析','食品/饮料研发','材料工程师']
            ]
    },
    
    show : function(that,param,opacity){
      var animation = wx.createAnimation({
        //持续时间800ms
        duration: 800,
        timingFunction: 'ease',
      });
      //var animation = this.animation
      animation.opacity(opacity).step()
      //将param转换为key
      var json = '{"' + param + '":""}'
      json = JSON.parse(json);
      json[param] = animation.export()
      //设置动画
      that.setData(json)
    },
  
    //滑动渐入渐出
    slideupshow:function(that,param,px,opacity){
      var animation = wx.createAnimation({
        duration: 800,
        timingFunction: 'ease',
      });
      animation.translateY(px).opacity(opacity).step()
      //将param转换为key
      var json = '{"' + param + '":""}'
      json = JSON.parse(json);
      json[param] = animation.export()
      //设置动画
      that.setData(json)
    },
  
    //向右滑动
    sliderightshow: function (that, param, rpx) {
      var animation = wx.createAnimation({
        duration: 800,
        timingFunction: 'ease',
      });
      var px = rpx*topx
      animation.translateX(px).step()
      //将param转换为key
      var json = '{"' + param + '":""}'
      json = JSON.parse(json);
      json[param] = animation.export()
      //设置动画
      that.setData(json)
    },

    /**
     * 初始化IM模块
     */
    
})

