// app.js
App({
    onLaunch() {
        wx.cloud.init({
          env:'cloud1-5gynw2ctad593524'//开发环境ID
        })
      },
    globalData:{//全局变量
      user:'',//用户基本信息(users表):昵称和头像链接
      openID:'',
      Friends:[{
        id:"oF9n75GH6_sVt1B3y7kbKpXgtuhM",
        lastread:0
      }],
      isboss:false,//是否为boss
      worker:{//员工的基本信息(worker表)：意向地址，意向工资，datas(投递、交流、收藏的数量),意向岗位
        yx_address:['四川省','广元市','旺苍县'],//默认
        yx_salary:[0,5],
        datas:[0,0,0],
        yx_post:[0,0]
      },
      post_classify:['技工/普工',
      '农/林/牧/渔',
      '机械/汽车',
      '物流/仓储/运输',
      '销售/商务/客服',
      '房地产/建筑/工程',
      '互联网技术',
      '互联网运营',
      '互联网产品',
      '市场/传媒',
      '设计',
      '人力行政',
      '财务金融',
      '教育培训',
      '电子电气',
      '法律/翻译/咨询',
      '采购/外贸',
      '质量/生产管理',
      '酒店/餐饮/旅游',
      '生物/医疗',
      '化学/化工'],
      post:[['普工/组装工','技工'],
            ['畜牧师','饲料研发','农艺师','园艺师','兽医','水产养殖技术员','林业技术员'],
            ['机械工程师','工艺工程师','汽车工程师','汽车美容','设备维修','机械结构工程师','汽车服务顾问','机械设计师','机械制图'],
            ['仓储','物流专员','运输','快递/配送','仓库管理员','仓库文书'],
            ['销售','海外销售','电话销售','渠道/分销','房地产销售','医美咨询','健康顾问','汽车销售','理财销售','保险销售','招生/课程顾问','广告/媒体销售','商务','客服','销售技术支持','销售运营'],
            ['房地产策划','开发报建','房地产评估','房地产成本/造价','房地产运营','房地产招标','物业管理','地产/园区招商','建筑设计','建筑机电设计','精装设计','建筑制图/绘图师','BIM工程师','园林/景观设计','室内/装修设计','建筑工程师','建筑施工技术员','测量/测绘','建筑机电工程师','土木/建筑工程师','园林/景观工程师','精装修工程师','房修工程师','市政工程师','道桥/隧道/港口','水利工程师'],
            ['后端开发','JAVA','测试工程师','项目管理','web前端','运维工程师','数据挖掘/机器学习','C++','算法工程师','语言/视频/图像处理','自然语言处理','数据开发','搜索/广告/推荐算法','Android','数据分析师','C#','PHP','IOS','IT技术支持','Golang','Python','IT硬件','售前技术支持','软件测试','U3D/COCOS2DX','网络工程师','网络安全','嵌入式','施工工程师','项目助理','售后技术支持','项目专员','Node.js','Ruby/Perl','自动化'],
            ['内容运营','产品运营','新媒体','用户运营','客服','电商运营','新媒体运营','客服专员','运营助理/专员','SEO/SEM','游戏运营','直播运营','网络客服','文案策划','内容编辑','跨境电商运营','售后客服','电话客服','售前客服'],
            ['产品经理','游戏策划','产品助理','数据产品经理','产品专员','用户研究'],
            ['创意/策划/公关','市场营销','新闻/编辑','摄影摄像','广告设计','导演/编剧','影视管理/发行','市场推广','主持人/主播/DJ','网络推广','后期制作','视频编辑','市场策划','剪辑师','会务会展','海外市场','剪辑师','活动策划','演员/配音/模特','自媒体','游戏推广','化妆/造型/服装'],
            ['UI设计','视觉设计师','平面设计','用户体验/交互','游戏/动画设计','美工','其它设计','3D设计师','CAD设计/制图','插画师','原画师','设计师助理','服装/纺织设计','工业设计'],
            ['行政专员/助理','人力资源/专员','总助/CEO助理/董事长助理','招聘','经理助理','后勤','前台'],
            ['银行','财会/审计','投融资','互联网金融','证券/基金','风控','会计','保险','行业研究','出纳','投资顾问'],
            ['教师','教务管理','课程顾问','职业培训','教研/课程设计','体育教师','IT培训','班主任/辅导员','英语教师','助教','家教/托管','小学教师','初中教师','高中教师','机器人/乐高培训','幼教','舞蹈老师','音乐老师','美术老师','球类教练','播音/表演教师'],
            ['硬件工程师','通信技术工程师','电气/自动化','电子工程师'],
            ['咨询/调研','企业管理咨询','法务','英语翻译','咨询项目管理','律师','法务专员/助理','日语翻译','法语翻译','其他语种翻译'],
            ['采购','采购专员/助理','外贸业务员','外贸文员','贸易跟单','单证员'],
            ['质检','生产运营','质量管理','生产计划管理'],
            ['服务员','厨师','餐饮店长','旅游服务','酒店前台','后厨帮工','导游/讲解员'],
            ['医师/医技','医疗销售','健康整形','医疗器械','护士','生物制药','医药研发','医药编辑','医生助理'],
            ['化学工程师','实验室技术员','化学分析','食品/饮料研发','材料工程师']]
    },
    
    show : function(that,param,opacity){
      var animation = wx.createAnimation({
        //持续时间800ms
        duration: 800,
        timingFunction: 'ease',
      });
      //var animation = this.animation
      animation.opacity(opacity).step()
      //将param转换为key
      var json = '{"' + param + '":""}'
      json = JSON.parse(json);
      json[param] = animation.export()
      //设置动画
      that.setData(json)
    },
  
    //滑动渐入渐出
    slideupshow:function(that,param,px,opacity){
      var animation = wx.createAnimation({
        duration: 800,
        timingFunction: 'ease',
      });
      animation.translateY(px).opacity(opacity).step()
      //将param转换为key
      var json = '{"' + param + '":""}'
      json = JSON.parse(json);
      json[param] = animation.export()
      //设置动画
      that.setData(json)
    },
  
    //向右滑动渐入渐出
    sliderightshow: function (that, param, px, opacity) {
      var animation = wx.createAnimation({
        duration: 800,
        timingFunction: 'ease',
      });
      animation.translateX(px).opacity(opacity).step()
      //将param转换为key
      var json = '{"' + param + '":""}'
      json = JSON.parse(json);
      json[param] = animation.export()
      //设置动画
      that.setData(json)
    }
})
